{"_env":"NODEJS","_serializationMethod":"normal","_autosave":false,"_autosaveInterval":5000,"_collections":[{"name":"items","unindexedSortComparator":"js","defaultLokiOperatorPackage":"js","_dynamicViews":[],"uniqueNames":[],"transforms":{},"rangedIndexes":{},"_data":[{"slug":"content","id":"covid_and_variants","title":"Covid and its Variants","description":"General info about covid and its variants","category":"Health","level":"general","author":"rmr","related":[{"id":"what_is_nft"},{"id":"what_is_blockchain_ledger"}],"cards":[{"q":"What is Covid","a":"Short for **Covid-19**, it is the newly identified disease that causes respiratory illness"},{"q":"When was Covid identified","a":"World Health Organisation (WHO) first learned of this new virus on 31 December 2019"},{"q":"How did Covid get its name","a":"**Co** is for Corona, **Vi** for Virus and **D** for Disease"},{"q":"What is the difference between Covid-19 and SARS-Cov-2","a":"Covid-19 is the infectious disease caused by the SARS-CoV-2 virus"},{"q":"Who issued the official names of Covid-19 and SARS-Cov-2","a":"The official names COVID-19 and SARS-Cov-2 were issued by WHO on 11 February 2020"},{"q":"What is the full form of SARS-Cov-2","a":"**S**evere **A**cute **R**espiratory **S**yndrome - **Co**rona**V**irus - **2**"},{"q":"What is the incubation period of Covid","a":"1 to 14 days"},{"q":"What are the common symptoms of Covid","a":"1. Fever or chills\n2. Cough\n3. Shortness of breath or difficulty breathing\n4. Fatigue\n5. Muscle or body aches\n"},{"q":"How does any virus spread","a":"To spread, a virus needs to infect a host, replicate and produce lots of copies of itself"},{"q":"What is a virus Mutation","a":"When a virus replicates it doesn't always manage to produce an exact copy of itself via a process called Mutation"},{"q":"In what way does a virus change","a":"The new copied virus may start to differ slightly in terms of its genetic sequence"},{"q":"What is a Variant","a":"Viruses that get produced with new mutations are called variants"},{"q":"What is a Strain","a":"When a new variant has different functional properties to the original virus and becomes established in a population, it is sometimes referred to as a new **strain** of the virus"},{"q":"So is a strain and variant the same","a":"All strains are variants, but not all variants are strains"},{"q":"How are the variants of Covid-19 named","a":"An expert group convened by WHO recommended using letters of the Greek Alphabet, i.e., Alpha, Beta, Gamma, Delta"},{"q":"What is the first Covid variant named","a":"Alpha"},{"q":"What is the list of variant names so far","a":"1. Alpha \n2. Beta  \n3. Gamma\n4. Delta\n5. Omicron\n"},{"q":"What are some of the variants being monitored","a":"1. Lambda\n2. Mu\n"},{"q":"What is the full form of PCR test","a":"**P**olymerase **C**hain **R**eaction **T**est"},{"q":"What is the full form of RT-PCR test","a":"**R**everse **T**ranscription **P**olymerase **C**hain **R**eaction  Test"},{"q":"What does PCR testing do","a":"PCR tests are used to directly screen for the presence of viral RNA (Ribonucleic Acid) in the body"},{"q":"What is the full form of CT value in a RT-PCR Test","a":"**C**ycle **T**hreshold value"},{"q":"What is the CT value that determines whether a patient has covid or not","a":"Popularly a value below 35 is considered positive and above being negative (*this threshold can vary from country to country*)\n"},{"q":"What are covid antibody / antigen tests","a":"They are tests done to detect corona proteins in a person's body to know if they has immunity against covid-19"},{"q":"Can an antigen test detect presence of covid","a":"No, they cannot diagnose covid"}],"dir":"/decks/en/covid_and_variants","path":"/decks/en/covid_and_variants/content","extension":".yaml","createdAt":"2022-01-27T05:50:52.005Z","updatedAt":"2022-01-29T05:31:57.658Z","meta":{"version":0,"revision":0,"created":1643694755743},"$loki":1},{"slug":"content","id":"what_is_bitcoin","title":"What is Bitcoin","description":"A brief overview for everyone","category":"Technical","level":"General","author":"rmr","related":[{"id":"what_is_nft"},{"id":"what_is_blockchain_ledger"}],"cards":[{"no":1,"q":"What are some of the needs of people","a":"- income\n- freedom\n- respect\n- security\n- equal treatment\n"},{"no":2,"q":"What is **Per Capita Income**","a":"Total Income of a country divided by Total Population"}],"dir":"/decks/en/what_is_bitcoin","path":"/decks/en/what_is_bitcoin/content","extension":".yaml","createdAt":"2022-01-24T03:27:46.971Z","updatedAt":"2022-01-28T08:07:54.520Z","meta":{"version":0,"revision":0,"created":1643694755743},"$loki":2},{"slug":"content","id":"what_is_blockchain_ledger","title":"What is Blockchain Ledger","description":"An overview for everyone","category":"Technical","level":"general","author":"rmr","related":[{"id":"what_is_nft"},{"id":"what_is_bitcoin"}],"cards":[{"q":"What is the **Ledger** in Blockchain Ledger mean","a":"A ledger, we all know, is an ordered list of transactions. Thus, an accounting ledger is a list of accounting transactions ordered by date or by account or by both. Similarly, a stock ledger is a list of incoming and outgoing items from a store; again ordered by item or by date."},{"q":"So what is a **Blocked Ledger**","a":"A Block Ledger is a group of transactions. This grouping could be all transactions by date or just a number of transactions."},{"q":"What, then, is a **Blockchain Ledger**","a":"A Blockchain Ledger is one when the Blocks of a ledger are chained together in terms of T1 (transaction 1) to T5 in, say, block B1. And you have transactions T6 to, say, T12 in block B2. And we also chain Block B2 to the end of B1. Then these become a BlockChain Ledger."},{"q":"Isn't this how all most digital ledgers work","a":"No. Because the trasactions in a Blockchain ledger system is not kept at one central place, but decentralised and distributed across different computers in a network."},{"q":"What does **Decentralised** Ledger mean","a":"If a ledger is not controlled by a central computer it is called a Decentralised Ledger"},{"q":"What does **Distributed** Ledger mean","a":"If a ledger, like a Blockchain Ledger, is available on multiple servers it is a Distributed Ledger"},{"q":"What is a **node**","a":"Another name for servers (computers) in a network"},{"q":"Are multiple copies of the data stored on multiple servers of the Blockchain network","a":"Yes."},{"q":"Is it not a waste of resources","a":"No. Since this is the only way to prevent a single ownership of data"},{"q":"What is wrong with someone storing all the data","a":"This gives that party leverage to control the use of that data. Examples of centralised data are:\n\n1. Government institutions like the Central Bank or Finance Ministry etc\n2. Social networks like: Facebook, Twitter, Instagram etc\n3. Digital Marketplaces like Amazon etc\n"},{"q":"So who owns the data in a Blockchain ledger system","a":"Collectively, by all the nodes of that distributed system"},{"q":"Then, would not the node control the data similar to how a central server has control of the data","a":"No.\n\nBecause the underlying principles of the blockchain network software ensures that no single node can unilaterally change the ledger data. There needs to be a consensus between all the nodes\n"},{"q":"Consensus? Meaning what?","a":"If any node makes a change to the ledger viz. adds, removes or updates an entry then other nodes will need to validate that change before the ledger gets updated"},{"q":"And how is that done?","a":"All via the underlying blockchain ledger software"},{"q":"Why is blockchain getting the sort of attention it does","a":"Because it removes the existence of a third-party to validate a transaction between two individuals"},{"q":"What are examples of third-party intermediaries that exist in the world today","a":"1. Government who confirms that currency given by one individual to another is authentic\n2. The Land records department who confirms that land owned by someone is truly that claimed by the owner\n3. Digital Marketplaces that confirm the sale of an item from a seller to a buyer\n"},{"q":"And such intermediaries can be avoided in a Blockchain system?","a":"Yes.\n\n1. Bitcoin is an example of a currency that is not controlled by any State or Government.\n2. The NFT is a classic example of the sale and purchase of assets.\n"}],"dir":"/decks/en/what_is_blockchain_ledger","path":"/decks/en/what_is_blockchain_ledger/content","extension":".yaml","createdAt":"2022-01-27T05:08:33.624Z","updatedAt":"2022-01-28T10:32:24.173Z","meta":{"version":0,"revision":0,"created":1643694755745},"$loki":3},{"slug":"content","id":"what_is_metaverse","title":"What is Metaverse","description":"A non-technical understanding of Metaverse","category":"Technical","level":"General","author":"rmr","related":[{"id":"what_is_nft"},{"id":"what_is_blockchain_ledger"}],"cards":[{"q":"How to describe Metaverse in a single sentence","a":"It is a 3D virtual world accessible via internet"},{"q":"What can be done in Metaverse","a":"1. Play games on a virtual playground or arena\n2. Learn in a virtual classroom\n3. Train to operate virtual machines\n4. Just hang around in an area and socialise with people\n5. Buy property!\n"},{"q":"Who coined the word","a":"It was first described in the 1992 novel **Snow Crash** by Neal Stephenson\n"},{"q":"When did it all start","a":"Technology is usually built bit by bit and Metaverse is no different. Virtual online communities were built in the early 2000s. *Second Life* in 2003 being one of the most popular.\n"},{"q":"Why is Metaverse getting popular now","a":"Time is ripe due to progress in:\n- 5G networks\n- more computing power and memory in small devices\n- coming of age of and VR and AR\n- need to work remotely\n"},{"q":"Do we need special equipment to participate in Metaverse","a":"1. A desktop or notebook computer\n2. A Virtual Reality (VR) headset for an immersive experience\n3. Tactile Gloves will help feel objects in this  world\n4. Wrist sensors to feel sensation (e.g. *Bow & Arrow games*) \n5. Augmented Reality (AR) Glasses to interact with objects\n"},{"q":"Do I need to walk at home to move in the virtual world","a":"No! That would be disastrous. There are a number of ways this is accomplished\n1. Using the keyboard one can move in two directions\n2. People wear a harness around them and walk like in a treadmill\n3. In some cases, you may just point to a place and you get teleported there\n"},{"q":"How would we use the keyboard to move","a":"For example:\n1. Moving the up and down arrow takes you forward or backward\n2. Similarly the left and right arrow moves you left or right\n3. Perhaps, a shift + left will turn your view to the left\n\nWhile keyboard equivalents are available, having a VR headset makes the experience immersive. \n"},{"q":"How do we focus or point to an object","a":"Just like we have a cursor on a normal computer, so is the case with a Metaverse world. \n1. The cursor can be pointed to an object and clicked to select via a mouse.\n2. Or if one uses a headset, then we turn in the desired direction and position the cursor on that object and tap on a button on the side of the headset. \n"},{"q":"Can we move objects in Metaverse","a":"Yes, this is much like in the physical world, where using the hand gloves, you could touch objects, move them, lift them and place them elsewhere\n"},{"q":"Can we speak to others in Metaverse","a":"Yes. You would need a mic and a speaker to talk and listen to others, similar to how we use them in a video conferencing session.\n&nbsp;\nMany of the VR headsets have inbuilt speakers and mikes attached.\n"},{"q":"Then, how is it different from video conferencing","a":"It is 3D and the experience gives you a feeling of being in the other place\n"},{"q":"Can we see the other person like we do in a video","a":"No. Everyone is represented by an **avatar**. Though many create avatars which have a resemblance to their own self.\n"},{"q":"How are avatars created similar to oneself","a":"Avatar creation softwares are available that take a bunch of snaps from different positions or using a camera to create an avatar. These avatars have a fair resemblance to the person. Once made, it can be kept as an indentity for all worlds.\n"},{"q":"Would not people make avatars that are different from how they look","a":"Yes. And very often that is the case. In fact, one of the likely reasons for its popularity is that a person can be a very **different** one in this virtual world. \n"},{"q":"Why are people buying space in Metaverse worlds","a":"All real estate investments are for two purposes:\n1. To stay or enjoy the property\n2. As investment to sell it when it appreciates\n\n&nbsp;\nIn the case of Metaverse it is the latter.\n"},{"q":"Is this similar to the **Real Player One** movie","a":"Yes. The movie which was based on the book by *Ernest Cline* explored how people escape the problems of earth by going into a virtual world!\n"}],"dir":"/decks/en/what_is_metaverse","path":"/decks/en/what_is_metaverse/content","extension":".yaml","createdAt":"2022-01-31T12:46:08.820Z","updatedAt":"2022-02-01T05:50:00.269Z","meta":{"version":0,"revision":0,"created":1643694755746},"$loki":4},{"slug":"content","id":"what_is_nft","title":"What is NFT","description":"An overview for everyone","category":"Technical","level":"general","author":"rmr","related":[{"id":"what_is_nft"},{"id":"what_is_blockchain_ledger"}],"cards":[{"q":"What is the full form of NFT","a":"**Non-fungible Token**\n\n- Non-fungible: meaning that it is *unique* and *cannot be changed*\n- Token is a *representation* of something and in this case it is a digital token\n\nIn short, NFT is a digital representation of something that is unique and cannot change.\n"},{"q":"What are some of the examples of things that can be NFTs","a":"1. Artworks\n2. Music, Videos\n3. Memorabilia, Collectibles\n4. Tweets\n5. Alcohol (Yes!)\n6. Source code (programs)\n7. Virtual real estate\n\nAlmost anything.\n"},{"q":"Does the NFT contain the digital item or asset?","a":"No. Again the NFT is a representation of the item, whether it is physical or digital"},{"q":"How can NFTs be offered for physical items?","a":"Remember an NFT is a **representation** for something, which can be a physical item too"},{"q":"What do we mean by representation of an item","a":"Think of how a *library card* in a physical Library is a representation of the physical book that is stored on the shelf"},{"q":"Does that mean that the asset, digital or physical, is stored elsewhere","a":"Yes.\n&nbsp;\nAt times it may be just a notional ownership not even having access to the underlying asset.\n"},{"q":"Does the owner of an NFT get copyrights to the underlying asset","a":"Usually not.\n&nbsp;\nSimilar to how in the physical world, purchasing a book does not give you copyright to its content or purchasing an artwork does not give you its rights.\n"},{"q":"Does this mean that an artwork (digital or otherwise) can be owned by several people","a":"Yes. But each will be a different NFT. A different token.\n&nbsp;\nThink of it similar to a limited edition giclee prints of some popular artwork.\n"},{"q":"It looks like there can be different terms in which an NFT can be sold. Right?","a":"Yes, the terms of the NFT are specified and part of the NFT"},{"q":"Why would someone buy an NFT","a":"Because it is of some value to them and in most cases it's value, they believe, would appreciate over time. Just like any other asset."},{"q":"Why would a creator sell an NFT","a":"It is another medium to sell something someone has created"},{"q":"Why would someone sell an item as a NFT instead of using shops or auction houses or brokers","a":"Usually to cut the middle-man\n&nbsp;\nNFTs are sold using a blocked chain network (explained in another deck) and it facilitates a direct buy-sell between two parties without a broker.\n"},{"q":"Do physical goods bought get sent to the buyer","a":"Yes. \n&nbsp;  \nThis will be as mentioned in the terms of purchase which are part of the NFT buying process.\n"},{"q":"Does owning a NFT give the buyer exclusive access to the asset","a":"Not necessary.\n&nbsp;\nIf there is an NFT sold, say, for a digital painting it does not necessary mean that the rest of the world cannot see that painting. The artist may choose to display the painting on her/his website.\n"},{"q":"Would this not diminish the value of the asset","a":"No. \n&nbsp;  \nTake the case of the famed *Mona Lisa* painting. The original art is in the Louvre musuem. Yet, all of us have access to view it digitally. Even prints of the painting are sold as copies. None of this diminishes the value of the original artwork.\n"},{"q":"Which was the first NFT that was sold by a major auction house","a":"A digital artwork called **Everydays: The First 5000 Days** by Beeple.\n\n1. This is a collage of 5000 digital images created by Mike Winkelmann (Beeple) \n2. This was sold for USD 69 million.\n"},{"q":"What are some of the popular NFTs that have been sold","a":"1. Beeple's \"Everydays: The First 5000 Days\"\n2. Jack Dorsey first tweet\n3. Distillers William Grant and Son sold 15 bottles of 46-year-old Glenfiddich whisky for $18,000 a piece\n4. NBA shots sports collectibles\n5. This Changed Everything is an NFT of the source code used for one of the earliest versions of the World Wide Web sold for USD 5.4 million\n"},{"q":"What is **The Merge**","a":"1. The Merge is a digital artwork created by an anonymous digital artist nicknamed Pak\n2. It was sold on Dec. 6, 2021 for $91.8 million\n3. The piece was fractionalized to 312,686 pieces distributed to 28,983 buyers\n4. The Merge was a single artwork composed of a collection of **masses** that users could buy\n5. These pieces could be *stockpiled* to make a bigger mass and sell it on the secondary market\n"}],"dir":"/decks/en/what_is_nft","path":"/decks/en/what_is_nft/content","extension":".yaml","createdAt":"2022-01-27T03:39:09.982Z","updatedAt":"2022-01-31T11:13:09.341Z","meta":{"version":0,"revision":0,"created":1643694755748},"$loki":5}],"idIndex":[1,2,3,4,5],"maxId":5,"_dirty":true,"_nestedProperties":[],"transactional":false,"asyncListeners":false,"disableMeta":false,"disableChangesApi":true,"disableDeltaChangesApi":true,"cloneObjects":false,"cloneMethod":"deep","changes":[],"_fullTextSearch":{"ii":{"title":{"_store":true,"_optimizeChanges":true,"docCount":5,"docStore":[[0,{"fieldLength":4}],[1,{"fieldLength":3}],[2,{"fieldLength":4}],[3,{"fieldLength":3}],[4,{"fieldLength":3}]],"totalFieldLength":17,"root":{"k":[99,97,105,118,119,98,108,109,110],"v":[{"k":[111],"v":[{"k":[118],"v":[{"k":[105],"v":[{"k":[100],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]}]},{"k":[110],"v":[{"k":[100],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]},{"k":[116,115],"v":[{"k":[115],"v":[{"d":{"df":1,"dc":[[0,1]]}}]},{"d":{"df":4,"dc":[[1,1],[2,1],[3,1],[4,1]]}}]},{"k":[97],"v":[{"k":[114],"v":[{"k":[105],"v":[{"k":[97],"v":[{"k":[110],"v":[{"k":[116],"v":[{"k":[115],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]}]}]}]}]},{"k":[104],"v":[{"k":[97],"v":[{"k":[116],"v":[{"d":{"df":4,"dc":[[1,1],[2,1],[3,1],[4,1]]}}]}]}]},{"k":[105,108],"v":[{"k":[116],"v":[{"k":[99],"v":[{"k":[111],"v":[{"k":[105],"v":[{"k":[110],"v":[{"d":{"df":1,"dc":[[1,1]]}}]}]}]}]}]},{"k":[111],"v":[{"k":[99],"v":[{"k":[107],"v":[{"k":[99],"v":[{"k":[104],"v":[{"k":[97],"v":[{"k":[105],"v":[{"k":[110],"v":[{"d":{"df":1,"dc":[[2,1]]}}]}]}]}]}]}]}]}]}]},{"k":[101],"v":[{"k":[100],"v":[{"k":[103],"v":[{"k":[101],"v":[{"k":[114],"v":[{"d":{"df":1,"dc":[[2,1]]}}]}]}]}]}]},{"k":[101],"v":[{"k":[116],"v":[{"k":[97],"v":[{"k":[118],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[115],"v":[{"k":[101],"v":[{"d":{"df":1,"dc":[[3,1]]}}]}]}]}]}]}]}]}]},{"k":[102],"v":[{"k":[116],"v":[{"d":{"df":1,"dc":[[4,1]]}}]}]}]}},"description":{"_store":true,"_optimizeChanges":true,"docCount":5,"docStore":[[0,{"fieldLength":7}],[1,{"fieldLength":5}],[2,{"fieldLength":4}],[3,{"fieldLength":5}],[4,{"fieldLength":4}]],"totalFieldLength":25,"root":{"k":[103,105,97,99,118,98,111,102,101,110,117,109],"v":[{"k":[101],"v":[{"k":[110],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[97],"v":[{"k":[108],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]}]}]}]},{"k":[110,116],"v":[{"k":[102],"v":[{"k":[111],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]},{"k":[115],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]},{"d":{"df":2,"dc":[[1,1],[3,1]]},"k":[98,110],"v":[{"k":[111],"v":[{"k":[117],"v":[{"k":[116],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]},{"d":{"df":2,"dc":[[2,1],[4,1]]},"k":[100],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]},{"k":[111],"v":[{"k":[118],"v":[{"k":[105],"v":[{"k":[100],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]}]},{"k":[97],"v":[{"k":[114],"v":[{"k":[105],"v":[{"k":[97],"v":[{"k":[110],"v":[{"k":[116],"v":[{"k":[115],"v":[{"d":{"df":1,"dc":[[0,1]]}}]}]}]}]}]}]}]},{"k":[114],"v":[{"k":[105],"v":[{"k":[101],"v":[{"k":[102],"v":[{"d":{"df":1,"dc":[[1,1]]}}]}]}]}]},{"k":[118,102],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[118],"v":[{"k":[105],"v":[{"k":[101],"v":[{"k":[119],"v":[{"d":{"df":3,"dc":[[1,1],[2,1],[4,1]]}}]}]}]}]}]}]},{"d":{"df":1,"dc":[[3,1]]}}]},{"k":[111],"v":[{"k":[114],"v":[{"d":{"df":3,"dc":[[1,1],[2,1],[4,1]]}}]}]},{"k":[118],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[121],"v":[{"k":[111],"v":[{"k":[110],"v":[{"k":[101],"v":[{"d":{"df":3,"dc":[[1,1],[2,1],[4,1]]}}]}]}]}]}]}]}]},{"k":[111],"v":[{"k":[110],"v":[{"k":[45],"v":[{"k":[116],"v":[{"k":[101],"v":[{"k":[99],"v":[{"k":[104],"v":[{"k":[110],"v":[{"k":[105],"v":[{"k":[99],"v":[{"k":[97],"v":[{"k":[108],"v":[{"d":{"df":1,"dc":[[3,1]]}}]}]}]}]}]}]}]}]}]}]}]}]},{"k":[110],"v":[{"k":[100],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[115],"v":[{"k":[116],"v":[{"k":[97],"v":[{"k":[110],"v":[{"k":[100],"v":[{"k":[105],"v":[{"k":[110],"v":[{"k":[103],"v":[{"d":{"df":1,"dc":[[3,1]]}}]}]}]}]}]}]}]}]}]}]}]}]},{"k":[101],"v":[{"k":[116],"v":[{"k":[97],"v":[{"k":[118],"v":[{"k":[101],"v":[{"k":[114],"v":[{"k":[115],"v":[{"k":[101],"v":[{"d":{"df":1,"dc":[[3,1]]}}]}]}]}]}]}]}]}]}]}},"slug":{"_store":true,"_optimizeChanges":true,"docCount":5,"docStore":[[0,{"fieldLength":1}],[1,{"fieldLength":1}],[2,{"fieldLength":1}],[3,{"fieldLength":1}],[4,{"fieldLength":1}]],"totalFieldLength":5,"root":{"k":[99],"v":[{"k":[111],"v":[{"k":[110],"v":[{"k":[116],"v":[{"k":[101],"v":[{"k":[110],"v":[{"k":[116],"v":[{"d":{"df":5,"dc":[[0,1],[1,1],[2,1],[3,1],[4,1]]}}]}]}]}]}]}]}]}},"text":{"_store":true,"_optimizeChanges":true,"docCount":0,"docStore":[],"totalFieldLength":0,"root":{}}}}}],"databaseVersion":1.5,"engineVersion":1.5,"filename":"content.db","_persistenceAdapter":null,"_persistenceMethod":null,"_throttledSaves":true}